print(3+2)
print (3 -2)
print (3*2)
print (10/2)
print (3**2)
print(8%2)
print(3//2)


print (type(10)) #Result - 'int'. Цельное число.
print(type(3.14)) #Result - Float. Дисятичные числа.
print(type(1+3j)) #Result - complex. Комплексное число. В Python комплексные числа записываются в виде a+bj, где j — мнимая единица.
print(type('Nikusya')) #Result - str. 'Nikusya' — это строка (string). Строковый тип.
print(type([1, 2, 3])) #Result - list. Списки. Списки в Python хранят упорядоченные данные, к ним можно обращаться по индексам, изменять и добавлять элементы.
print(type({'name':'Nikusya'})) #Result - dict. Словарь. В словаре данные хранятся в виде пар "ключ : значение". Здесь ключ — 'name', значение — 'Nikusya' 
print(type({9.8, 6.3, 10,2})) #Result set. Множество. В множествах элементы уникальны и неупорядочены. Если добавить повторяющийся элемент, он сохранится только один раз.
print(type((9.8, 3.14, ))) #Result tuple. Кортеж. Кортеж похож на список, но он неизменяемый (нельзя менять элементы после создания).
print(type(3==3)) #Result - bool. 3==3 — это выражение сравнения (равно ли 3 и 3). Результат: True (логический тип, принимает только True или False).
print(type(3>=3)) #Resulr - bool. 3>=3 проверяет: "3 больше или равно 3?"📌 Это тоже будет True. 